/*
    문제55 : 하노이의 탑

    하노이의 탑은 프랑스 수학자 에두아르드가 처음으로 발표한 게임입니다.
    하노이의 탑은 A, B, C 3개의 기둥과 기둥에 꽂을 수 있는 N 개의 원반으로 이루어져 있습니다.
    이 게임에서는 다음의 규칙을 만족해야 합니다.

    1. 처음에 모든 원반은 A 기둥에 꽂혀 있다.
    2. 모든 원반의 지름은 다르다.
    3. 이 원반은 세 개의 기둥 중 하나에 반드시 꽂혀야 한다.
    4. 작은 원반 위에 큰 원반을 놓을 수 없다.
    5. 한 번에 하나의 원반(가장 위에 있는 원반)만을 옮길 수 있다.

  * 이 규칙을 만족하며 A 기둥에 있는 원반 N 개를 모두 C 원반으로 옮기고 싶습니다.
  * 모든 원반을 옮기기 위해 실행되어야 할 최소 원반 이동 횟수를 계산하는 프로그램을 완성해 주세요.
*/

// ? 종료조건 :
// C 기둥에 모든 원반이 있으면 종료
// ? 문제의 정의 :
// 가장큰원반은 목적기둥에 있어야함
// n개의 원반을 목적기둥으로 옮기려면 n - 1개의 원반을 router 기둥에 옮겨야함
// router 기둥의 n - 1개의 원반을 목적기둥으로 옮겨야함

let route = 0;

function hanoi(num, start, end, router){
    debugger;
    if(num === 0) return;
    hanoi(num -1, start, router, end); // A -> B || A -> C
    console.log(` ${num}번 원반을 ${start} -> ${end}`);
    route++;
    hanoi(num - 1, router, end, start); // B -> A || B -> C
}

hanoi(2, 'A', 'C', 'B');
console.log(route);
